QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR32EA28def.inc
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ********************

;*************************************************************************
;* A P P L I C A T I O N   N O T E   F O R   T H E   A V R   F A M I L Y
;*
;* Number            : AVR000
;* File Name         : AVR32EA28def.inc
;* Title             : Register/Bit Definitions for the AVR32EA28
;* Created           : 2023-06-26 11:39
;* Version           : 1.00
;* Support           : https://microchipsupport.force.com/
;* Target MCU        : AVR32EA28
;*
;* DESCRIPTION
;* When including this file in the assembly program file, all I/O register
;* names and I/O register bit names appearing in the data book can be used.
;* In addition, the six registers forming the three data pointers X, Y and
;* Z have been assigned names XL - ZH. Highest RAM address for Internal
;* SRAM is also defined
;*
;*************************************************************************

#ifndef _AVR32EA28DEF_INC_
#define _AVR32EA28DEF_INC_


#pragma partinc 0

; ***** SPECIFY DEVICE ***************************************************
.device	AVR32EA28

#pragma AVRPART ADMIN PART_NAME AVR32EA28

.equ	SIGNATURE_000	= 0x1E
.equ	SIGNATURE_001	= 0x95
.equ	SIGNATURE_002	= 0x3E

#pragma AVRPART CORE CORE_VERSION V4S


; ***** ABSOLUTE I/O REGISTER LOCATIONS **********************************


;*************************************************************************
;** AC0 - Analog Comparator
;*************************************************************************

.equ AC0_CTRLA = 0x0680                  ; Control A
.equ AC0_CTRLB = 0x0681                  ; Control B
.equ AC0_MUXCTRL = 0x0682                ; Mux Control A
.equ AC0_DACREF = 0x0685                 ; DAC Voltage Reference
.equ AC0_INTCTRL = 0x0686                ; Interrupt Control
.equ AC0_STATUS = 0x0687                 ; Status

;*************************************************************************
;** AC1 - Analog Comparator
;*************************************************************************

.equ AC1_CTRLA = 0x0688                  ; Control A
.equ AC1_CTRLB = 0x0689                  ; Control B
.equ AC1_MUXCTRL = 0x068A                ; Mux Control A
.equ AC1_DACREF = 0x068D                 ; DAC Voltage Reference
.equ AC1_INTCTRL = 0x068E                ; Interrupt Control
.equ AC1_STATUS = 0x068F                 ; Status

;*************************************************************************
;** ADC0 - Analog to Digital Converter
;*************************************************************************

.equ ADC0_CTRLA = 0x0600                 ; Control A
.equ ADC0_CTRLB = 0x0601                 ; Control B
.equ ADC0_CTRLC = 0x0602                 ; Control C
.equ ADC0_CTRLD = 0x0603                 ; Control D
.equ ADC0_INTCTRL = 0x0604               ; Interrupt Control
.equ ADC0_INTFLAGS = 0x0605              ; Interrupt Flags
.equ ADC0_STATUS = 0x0606                ; Status register
.equ ADC0_DBGCTRL = 0x0607               ; Debug Control
.equ ADC0_CTRLE = 0x0608                 ; Control E
.equ ADC0_CTRLF = 0x0609                 ; Control F
.equ ADC0_COMMAND = 0x060A               ; Command register
.equ ADC0_PGACTRL = 0x060B               ; PGA Control
.equ ADC0_MUXPOS = 0x060C                ; Positive Input Multiplexer
.equ ADC0_MUXNEG = 0x060D                ; Negative Input Multiplexer
.equ ADC0_RESULT = 0x0610                ; Result
.equ ADC0_RESULT0 = 0x0610               ; Result 0
.equ ADC0_RESULT1 = 0x0611               ; Result 1
.equ ADC0_RESULT2 = 0x0612               ; Result 2
.equ ADC0_RESULT3 = 0x0613               ; Result 3
.equ ADC0_SAMPLE = 0x0614                ; Sample
.equ ADC0_SAMPLEL = 0x0614               ; Sample low byte
.equ ADC0_SAMPLEH = 0x0615               ; Sample hi byte
.equ ADC0_TEMP0 = 0x0618                 ; Temporary Data 0
.equ ADC0_TEMP1 = 0x0619                 ; Temporary Data 1
.equ ADC0_TEMP2 = 0x061A                 ; Temporary Data 2
.equ ADC0_WINLT = 0x061C                 ; Window Low Threshold
.equ ADC0_WINLTL = 0x061C                ; Window Low Threshold low byte
.equ ADC0_WINLTH = 0x061D                ; Window Low Threshold hi byte
.equ ADC0_WINHT = 0x061E                 ; Window High Threshold
.equ ADC0_WINHTL = 0x061E                ; Window High Threshold low byte
.equ ADC0_WINHTH = 0x061F                ; Window High Threshold hi byte

;*************************************************************************
;** BOD - Bod interface
;*************************************************************************

.equ BOD_CTRLA = 0x00A0                  ; Control A
.equ BOD_CTRLB = 0x00A1                  ; Control B
.equ BOD_VLMCTRLA = 0x00A8               ; Voltage level monitor Control
.equ BOD_INTCTRL = 0x00A9                ; Voltage level monitor interrupt Control
.equ BOD_INTFLAGS = 0x00AA               ; Voltage level monitor interrupt Flags
.equ BOD_STATUS = 0x00AB                 ; Voltage level monitor status

;*************************************************************************
;** CCL - Configurable Custom Logic
;*************************************************************************

.equ CCL_CTRLA = 0x01C0                  ; Control Register A
.equ CCL_SEQCTRL0 = 0x01C1               ; Sequential Control 0
.equ CCL_SEQCTRL1 = 0x01C2               ; Sequential Control 1
.equ CCL_INTCTRL0 = 0x01C5               ; Interrupt Control 0
.equ CCL_INTFLAGS = 0x01C7               ; Interrupt Flags
.equ CCL_LUT0CTRLA = 0x01C8              ; LUT 0 Control A
.equ CCL_LUT0CTRLB = 0x01C9              ; LUT 0 Control B
.equ CCL_LUT0CTRLC = 0x01CA              ; LUT 0 Control C
.equ CCL_TRUTH0 = 0x01CB                 ; Truth 0
.equ CCL_LUT1CTRLA = 0x01CC              ; LUT 1 Control A
.equ CCL_LUT1CTRLB = 0x01CD              ; LUT 1 Control B
.equ CCL_LUT1CTRLC = 0x01CE              ; LUT 1 Control C
.equ CCL_TRUTH1 = 0x01CF                 ; Truth 1
.equ CCL_LUT2CTRLA = 0x01D0              ; LUT 2 Control A
.equ CCL_LUT2CTRLB = 0x01D1              ; LUT 2 Control B
.equ CCL_LUT2CTRLC = 0x01D2              ; LUT 2 Control C
.equ CCL_TRUTH2 = 0x01D3                 ; Truth 2
.equ CCL_LUT3CTRLA = 0x01D4              ; LUT 3 Control A
.equ CCL_LUT3CTRLB = 0x01D5              ; LUT 3 Control B
.equ CCL_LUT3CTRLC = 0x01D6              ; LUT 3 Control C
.equ CCL_TRUTH3 = 0x01D7                 ; Truth 3

;*************************************************************************
;** CLKCTRL - Clock controller
;*************************************************************************

.equ CLKCTRL_MCLKCTRLA = 0x0060          ; MCLK Control A
.equ CLKCTRL_MCLKCTRLB = 0x0061          ; MCLK Control B
.equ CLKCTRL_MCLKCTRLC = 0x0062          ; MCLK Control C
.equ CLKCTRL_MCLKINTCTRL = 0x0063        ; MCLK Interrupt Control
.equ CLKCTRL_MCLKINTFLAGS = 0x0064       ; MCLK Interrupt Flags
.equ CLKCTRL_MCLKSTATUS = 0x0065         ; MCLK Status
.equ CLKCTRL_MCLKTIMEBASE = 0x0066       ; MCLK Timebase
.equ CLKCTRL_OSCHFCTRLA = 0x0068         ; OSCHF Control A
.equ CLKCTRL_OSCHFTUNE = 0x0069          ; OSCHF Tune
.equ CLKCTRL_OSC32KCTRLA = 0x0078        ; OSC32K Control A
.equ CLKCTRL_XOSC32KCTRLA = 0x007C       ; XOSC32K Control A
.equ CLKCTRL_XOSCHFCTRLA = 0x0080        ; XOSCHF Control A

;*************************************************************************
;** CPU - CPU
;*************************************************************************

