QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR32EA28def.inc
; SYSCFG_REVID masks
.equ SYSCFG_MINOR_gm = 0x0F              ; Minor Revision group mask
.equ SYSCFG_MINOR_gp = 0                 ; Minor Revision group position
.equ SYSCFG_MINOR_0_bm = (1<<0)          ; Minor Revision bit 0 mask
.equ SYSCFG_MINOR_0_bp = 0               ; Minor Revision bit 0 position
.equ SYSCFG_MINOR_1_bm = (1<<1)          ; Minor Revision bit 1 mask
.equ SYSCFG_MINOR_1_bp = 1               ; Minor Revision bit 1 position
.equ SYSCFG_MINOR_2_bm = (1<<2)          ; Minor Revision bit 2 mask
.equ SYSCFG_MINOR_2_bp = 2               ; Minor Revision bit 2 position
.equ SYSCFG_MINOR_3_bm = (1<<3)          ; Minor Revision bit 3 mask
.equ SYSCFG_MINOR_3_bp = 3               ; Minor Revision bit 3 position
.equ SYSCFG_MAJOR_gm = 0xF0              ; Major Revision group mask
.equ SYSCFG_MAJOR_gp = 4                 ; Major Revision group position
.equ SYSCFG_MAJOR_0_bm = (1<<4)          ; Major Revision bit 0 mask
.equ SYSCFG_MAJOR_0_bp = 4               ; Major Revision bit 0 position
.equ SYSCFG_MAJOR_1_bm = (1<<5)          ; Major Revision bit 1 mask
.equ SYSCFG_MAJOR_1_bp = 5               ; Major Revision bit 1 position
.equ SYSCFG_MAJOR_2_bm = (1<<6)          ; Major Revision bit 2 mask
.equ SYSCFG_MAJOR_2_bp = 6               ; Major Revision bit 2 position
.equ SYSCFG_MAJOR_3_bm = (1<<7)          ; Major Revision bit 3 mask
.equ SYSCFG_MAJOR_3_bp = 7               ; Major Revision bit 3 position

; SYSCFG_OCDMCTRL masks
.equ SYSCFG_OCDM_gm = 0xFF               ; OCD Message group mask
.equ SYSCFG_OCDM_gp = 0                  ; OCD Message group position
.equ SYSCFG_OCDM_0_bm = (1<<0)           ; OCD Message bit 0 mask
.equ SYSCFG_OCDM_0_bp = 0                ; OCD Message bit 0 position
.equ SYSCFG_OCDM_1_bm = (1<<1)           ; OCD Message bit 1 mask
.equ SYSCFG_OCDM_1_bp = 1                ; OCD Message bit 1 position
.equ SYSCFG_OCDM_2_bm = (1<<2)           ; OCD Message bit 2 mask
.equ SYSCFG_OCDM_2_bp = 2                ; OCD Message bit 2 position
.equ SYSCFG_OCDM_3_bm = (1<<3)           ; OCD Message bit 3 mask
.equ SYSCFG_OCDM_3_bp = 3                ; OCD Message bit 3 position
.equ SYSCFG_OCDM_4_bm = (1<<4)           ; OCD Message bit 4 mask
.equ SYSCFG_OCDM_4_bp = 4                ; OCD Message bit 4 position
.equ SYSCFG_OCDM_5_bm = (1<<5)           ; OCD Message bit 5 mask
.equ SYSCFG_OCDM_5_bp = 5                ; OCD Message bit 5 position
.equ SYSCFG_OCDM_6_bm = (1<<6)           ; OCD Message bit 6 mask
.equ SYSCFG_OCDM_6_bp = 6                ; OCD Message bit 6 position
.equ SYSCFG_OCDM_7_bm = (1<<7)           ; OCD Message bit 7 mask
.equ SYSCFG_OCDM_7_bp = 7                ; OCD Message bit 7 position

; SYSCFG_OCDMSTATUS masks
.equ SYSCFG_VALID_bm = 0x01              ; OCD Message Valid bit mask
.equ SYSCFG_VALID_bp = 0                 ; OCD Message Valid bit position


;*************************************************************************
;** TCA - 16-bit Timer/Counter Type A
;*************************************************************************

; TCA_SINGLE_CTRLA masks
.equ TCA_SINGLE_ENABLE_bm = 0x01         ; Module Enable bit mask
.equ TCA_SINGLE_ENABLE_bp = 0            ; Module Enable bit position
.equ TCA_SINGLE_CLKSEL_gm = 0x0E         ; Clock Selection group mask
.equ TCA_SINGLE_CLKSEL_gp = 1            ; Clock Selection group position
.equ TCA_SINGLE_CLKSEL_0_bm = (1<<1)     ; Clock Selection bit 0 mask
.equ TCA_SINGLE_CLKSEL_0_bp = 1          ; Clock Selection bit 0 position
.equ TCA_SINGLE_CLKSEL_1_bm = (1<<2)     ; Clock Selection bit 1 mask
.equ TCA_SINGLE_CLKSEL_1_bp = 2          ; Clock Selection bit 1 position
.equ TCA_SINGLE_CLKSEL_2_bm = (1<<3)     ; Clock Selection bit 2 mask
.equ TCA_SINGLE_CLKSEL_2_bp = 3          ; Clock Selection bit 2 position
.equ TCA_SINGLE_RUNSTDBY_bm = 0x80       ; Run in Standby bit mask
.equ TCA_SINGLE_RUNSTDBY_bp = 7          ; Run in Standby bit position

; TCA_SINGLE_CTRLB masks
.equ TCA_SINGLE_WGMODE_gm = 0x07         ; Waveform generation mode group mask
.equ TCA_SINGLE_WGMODE_gp = 0            ; Waveform generation mode group position
.equ TCA_SINGLE_WGMODE_0_bm = (1<<0)     ; Waveform generation mode bit 0 mask
.equ TCA_SINGLE_WGMODE_0_bp = 0          ; Waveform generation mode bit 0 position
.equ TCA_SINGLE_WGMODE_1_bm = (1<<1)     ; Waveform generation mode bit 1 mask
.equ TCA_SINGLE_WGMODE_1_bp = 1          ; Waveform generation mode bit 1 position
.equ TCA_SINGLE_WGMODE_2_bm = (1<<2)     ; Waveform generation mode bit 2 mask
.equ TCA_SINGLE_WGMODE_2_bp = 2          ; Waveform generation mode bit 2 position
.equ TCA_SINGLE_ALUPD_bm = 0x08          ; Auto Lock Update bit mask
.equ TCA_SINGLE_ALUPD_bp = 3             ; Auto Lock Update bit position
.equ TCA_SINGLE_CMP0EN_bm = 0x10         ; Compare 0 Enable bit mask
.equ TCA_SINGLE_CMP0EN_bp = 4            ; Compare 0 Enable bit position
.equ TCA_SINGLE_CMP1EN_bm = 0x20         ; Compare 1 Enable bit mask
.equ TCA_SINGLE_CMP1EN_bp = 5            ; Compare 1 Enable bit position
.equ TCA_SINGLE_CMP2EN_bm = 0x40         ; Compare 2 Enable bit mask
.equ TCA_SINGLE_CMP2EN_bp = 6            ; Compare 2 Enable bit position

; TCA_SINGLE_CTRLC masks
.equ TCA_SINGLE_CMP0OV_bm = 0x01         ; Compare 0 Waveform Output Value bit mask
.equ TCA_SINGLE_CMP0OV_bp = 0            ; Compare 0 Waveform Output Value bit position
.equ TCA_SINGLE_CMP1OV_bm = 0x02         ; Compare 1 Waveform Output Value bit mask
.equ TCA_SINGLE_CMP1OV_bp = 1            ; Compare 1 Waveform Output Value bit position
.equ TCA_SINGLE_CMP2OV_bm = 0x04         ; Compare 2 Waveform Output Value bit mask
.equ TCA_SINGLE_CMP2OV_bp = 2            ; Compare 2 Waveform Output Value bit position

; TCA_SINGLE_CTRLD masks
.equ TCA_SINGLE_SPLITM_bm = 0x01         ; Split Mode Enable bit mask
.equ TCA_SINGLE_SPLITM_bp = 0            ; Split Mode Enable bit position

; TCA_SINGLE_CTRLECLR masks
.equ TCA_SINGLE_DIR_bm = 0x01            ; Direction bit mask
.equ TCA_SINGLE_DIR_bp = 0               ; Direction bit position
.equ TCA_SINGLE_LUPD_bm = 0x02           ; Lock Update bit mask
.equ TCA_SINGLE_LUPD_bp = 1              ; Lock Update bit position
.equ TCA_SINGLE_CMD_gm = 0x0C            ; Command group mask
.equ TCA_SINGLE_CMD_gp = 2               ; Command group position
.equ TCA_SINGLE_CMD_0_bm = (1<<2)        ; Command bit 0 mask
.equ TCA_SINGLE_CMD_0_bp = 2             ; Command bit 0 position
.equ TCA_SINGLE_CMD_1_bm = (1<<3)        ; Command bit 1 mask
.equ TCA_SINGLE_CMD_1_bp = 3             ; Command bit 1 position

